jmeter-test-scripts/DLT_Scalability_unlock accounts.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="DLT_Scalability" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(users,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,5)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Creates nodeIp variables" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script">def nopeIps = [&quot;168.63.36.25&quot;, &quot;168.63.67.155&quot;, &quot;168.61.102.124&quot;, &quot;168.61.87.200&quot;, &quot;168.61.100.121&quot;, &quot;168.61.97.247&quot;, &quot;51.137.107.133&quot;, &quot;51.144.32.55&quot;, &quot;51.144.38.49&quot;, &quot;51.144.110.93&quot;, &quot;137.117.174.220&quot;, &quot;52.136.252.105&quot;, &quot;51.141.118.214&quot;, &quot;51.141.118.195&quot;, &quot;51.141.114.160&quot;, &quot;51.141.116.252&quot;, &quot;51.141.117.74&quot;, &quot;40.120.41.60&quot;, &quot;40.120.41.164&quot;, &quot;40.120.41.159&quot;, &quot;51.140.143.208&quot;, &quot;40.120.40.150&quot;, &quot;20.188.32.56&quot;, &quot;52.143.156.140&quot;, &quot;40.89.188.60&quot;, &quot;40.89.186.100&quot;, &quot;40.89.186.156&quot;, &quot;20.188.39.57&quot;];



nopeIps.eachWithIndex {line, idx -&gt;
    vars.put(&quot;nodeIp&quot; + idx, line);
    //log.info(&quot;nodeIp&quot;+idx + &quot;: &quot; + vars.get(&quot;nodeIp&quot;+ idx));
}
</stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <WhileController guiclass="WhileControllerGui" testclass="WhileController" testname="While | Unlock accounts" enabled="true">
          <stringProp name="WhileController.condition">${__javaScript(&quot;${nodeCounter}&quot; != &quot;${numberOfNodes}&quot;,)}</stringProp>
        </WhileController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get address" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;jsonrpc&quot;:&quot;2.0&quot;,&quot;method&quot;:&quot;eth_accounts&quot;,&quot;params&quot;:[],&quot;id&quot;:1}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${currentNodeIp}</stringProp>
            <stringProp name="HTTPSampler.port">22000</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Increments" enabled="true">
              <stringProp name="scriptLanguage">groovy</stringProp>
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">def counter = vars.get(&quot;nodeCounter&quot;).toInteger();
log.info(&quot;nodeCounter val before: &quot; + counter);

def increment;
def currentNodeIp;

//gets specifc ip from var and sets that to the currentNodeIp variable to be used in the loop.
currentNodeIp = vars.get(&quot;nodeIp&quot;+counter);	
vars.put(&quot;currentNodeIp&quot;, currentNodeIp);

//increment counter
increment = counter + 1;	
vars.put(&quot;nodeCounter&quot;, increment.toString());

//----Log---
log.info(&quot;currentNodeIp: &quot; + vars.get(&quot;currentNodeIp&quot;));


log.info(&quot;nodeCounter val after: &quot; + increment);</stringProp>
            </JSR223PreProcessor>
            <hashTree/>
            <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Set accountAdress" enabled="true">
              <stringProp name="JSONPostProcessor.referenceNames">currentFromAddress</stringProp>
              <stringProp name="JSONPostProcessor.jsonPathExprs">$.result</stringProp>
              <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            </JSONPostProcessor>
            <hashTree/>
            <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Cleans response from address" enabled="true">
              <stringProp name="cacheKey">true</stringProp>
              <stringProp name="script">import org.apache.jmeter.services.FileServer;

def currentFromAddress = vars.get(&quot;currentFromAddress&quot;);
def cleanedAddress = currentFromAddress.replace(&quot;[&quot;,&quot;&quot;).replace(&quot;]&quot;,&quot;&quot;);
def counter = Integer.parseInt(vars.get(&quot;nodeCounter&quot;))-1;


log.info(&quot;increment: &quot; + counter.toString());
vars.put(&quot;currentFromAddress&quot;, cleanedAddress);

//creates new address variable
vars.put(&quot;fromAddress&quot;+counter.toString(), cleanedAddress);
log.info(&quot;New var -&gt; fromAddress&quot; + counter.toString() + &quot;: &quot; + vars.get(&quot;currentFromAddress&quot;));
log.info(&quot;currentFromAddress: &quot; + vars.get(&quot;currentFromAddress&quot;));

f = new FileOutputStream(FileServer.getFileServer().getBaseDir()+&quot;\\addresses.csv&quot;, true); 
p = new PrintStream(f); 

// Write data to file 
p.println( vars.get(&quot;currentNodeIp&quot;) + &quot;,&quot; + vars.get(&quot;currentFromAddress&quot;));

// Close File(s)
p.close();
f.close();

</stringProp>
              <stringProp name="scriptLanguage">groovy</stringProp>
            </JSR223PostProcessor>
            <hashTree/>
          </hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="unlock account" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&quot;jsonrpc&quot;:&quot;2.0&quot;,&quot;method&quot;:&quot;personal_unlockAccount&quot;,&quot;params&quot;:[${currentFromAddress}, &quot;Deloitte&quot;, 0],&quot;id&quot;:1}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.domain">${currentNodeIp}</stringProp>
            <stringProp name="HTTPSampler.port">22000</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="functionHash" elementType="Argument">
            <stringProp name="Argument.name">functionHash</stringProp>
            <stringProp name="Argument.value">&quot;0xd09de08a&quot;</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="numberOfNodes" elementType="Argument">
            <stringProp name="Argument.name">numberOfNodes</stringProp>
            <stringProp name="Argument.value">28</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="nodeCounter" elementType="Argument">
            <stringProp name="Argument.name">nodeCounter</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="contractAddressMined" elementType="Argument">
            <stringProp name="Argument.name">contractAddressMined</stringProp>
            <stringProp name="Argument.value">0</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>